{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Honours Bachelor of Science, with Distinction",
      "department": "Statistics and Mathematics",
      "duration": "2017-2021",
      "school_name": "University of Toronto - St. George Campus"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_demo",
  "highlighted_projects": [
    {
      "description": "\n - Implemented a complex and lengthy set of instruction for the computer to perform using Windows API as a base to diminish labour. \n - Researched and incorporated image and pixel searching tools to precisely determine which stage of instructions the computer is performing to reduce automation time by 30%.\n - Constructed separate executable for different stages of the automation to cut down the testing time and cost by a significant amount.",
      "name": "Computer Automation"
    },
    {
      "description": "This project based on the computer automation that I performed on the above project.\n - Designed and performed a replicated exponential factorial experiment to abolish the ambiguity and precisely determine the efficiency of two contrasting scripts.\n - Enhanced the computer automation efficiency by 10% through utilizing the statistical conclusions written from the experiment.",
      "git_url": null,
      "name": "Data Analysis on Computer Automation"
    },
    {
      "description": "\n - Implemented a fully-connected neural network (multi-layer perceptron) with 10-dimensional hidden layer with a trigonometric non-linearity.\n - Performed gradient-descent using automatic differentiation to estimate parameters given the batch-size, model variance and learning rate.\n - Adjusted and improved the neural network to learn both the mean and variance of the Gaussian model.",
      "git_url": null,
      "name": "Non-linear Regression Model with a Neural Network"
    }
  ],
  "jarvis_projects": [
    {
      "description": [
        "Provided the Jarvis Linux Cluster Administration (LCA) team with a Minimum Viable Product (MVP) for recording the hardware specifications and resource usage for nodes.\"",
        "Developed bash scripts for automatically collecting the hardware specifications and resource usage from nodes and record it in a RDBMS, PostgreSQL.",
        "Used docker to create a container for PostgreSQL to create/start/stop the database.",
        "Queried the database to perform and collect specific data for related business questions of interest.",
        "Utilized CRONTAB to automatically data every 1 minute interval from all the servers."
      ],
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "In Progress",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "Not Started",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "Not Started",
      "git_url": "/spark",
      "name": "Spark"
    }
  ],
  "name": "Sowon Ham",
  "others": [
    {
      "bullets": [
        "Badminton Player",
        "PC Gaming",
        "Build automation scripts for convenience"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "\n - Provided the Jarvis LCA team with a MVP that collects hardware specification and resource usage on nodes using Bash scripting and store the data into a RDBMS, PostgreSQL.\n - Query the database several times to answer business related questions and observe the data.\n - Collaborated with teams to solve problems that were rather not trivial.",
      "duration": "2021.12-Present",
      "title": "Data Analyst Consultant"
    },
    {
      "company": "St. Paschal Baylon Church",
      "description": "\n - Enthusiastic to learn new methods to quickly incorporate it into the working environment.\n - Immensely communicated with other crew members to work efficiently and not overlap cleaning the same areas. - Flexible with abrupt changes in work schedule to accommodate and prepare for any uprising matters.",
      "duration": "2016.05-2016.09",
      "title": "Volunteer Work"
    }
  ],
  "skills": {
    "competent": [
      "Stochastic Processes",
      "Microsoft Excel",
      "Java",
      "Julia",
      "Python",
      "Forecasting",
      "Tidyverse"
    ],
    "familiar": [
      "Virtual Network Computing (VNC)",
      "Verilog",
      "Machine Learning (Neural Network, Cluster Algorithms)",
      "Forecasting",
      "Cloud Networking"
    ],
    "proficient": [
      "R/RMarkdown/LaTeX",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/GitFlow",
      "AutoIt",
      "Docker",
      "Statistics (A/B Testing, Hypothesis Testing, Time Series Analysis)",
      "Experimental Design"
    ]
  },
  "summary": "I am a recent graduate of University of Toronto - St. George Campus and I studied statistics and mathematics in my degree. Due to my passion in the DA/BA/BSA field I pursued to a profession that suits my strength and my likings. Jarvis Consulting Group is the first place that I was able to thoroughly communicate with and resulted in a very positive manner to work here as one of the employee.\n\n It is such an honor to be working in a field that is continuously growing every day and see everyone including myself studying new subjects every day. Particularly, while I was studying in my field the process of gathering data, building statistical models, and analyzing through mathematical methods fascinated me to a great extent. I wish to pursue in this field to continuously learn and apply old and new methods of data analysis to play with data."
}
